<?xml version="1.0"?>
<net name="Model6" version="11">
	<layers>
		<layer id="0" name="image" type="Parameter" version="opset1">
			<data shape="1,3,224,224" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="image">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="__module.model.backbone/aten::expand/Broadcast_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 192" offset="0" size="384" />
			<output>
				<port id="0" precision="FP16" names="39">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="__module.model.backbone/aten::expand/Broadcast" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="self.model.backbone.patch_embed.proj.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="192, 3, 16, 16" offset="384" size="294912" />
			<output>
				<port id="0" precision="FP16" names="self.model.backbone.patch_embed.proj.weight">
					<dim>192</dim>
					<dim>3</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="self.model.backbone.patch_embed.proj.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>3</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>3</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="__module.model.backbone.patch_embed.proj/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="16, 16" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>3</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="__module.model.backbone.patch_embed.proj/aten::_convolution/Reshape_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 192, 1, 1" offset="295296" size="384" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="__module.model.backbone.patch_embed.proj/aten::_convolution/Reshape" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="__module.model.backbone.patch_embed.proj/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="34,x.1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_140436" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="295680" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="__module.model.backbone.patch_embed/aten::flatten/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="35">
					<dim>1</dim>
					<dim>192</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="__module.model.backbone.patch_embed/aten::transpose/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="295704" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="__module.model.backbone.patch_embed/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="36,x.3">
					<dim>1</dim>
					<dim>196</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="__module.model.backbone/aten::cat/Concat" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>196</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="41,x.5">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="__module.model.backbone/aten::add/Multiply_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 197, 192" offset="295716" size="75648" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="__module.model.backbone/aten::add/Multiply" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="__module.model.backbone/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="42,input.1">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="__module.model.backbone.blocks.0.norm1/aten::layer_norm/Multiply" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="371364" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="__module.model.backbone.blocks.0.norm1/aten::layer_norm/MVN" type="MVN" version="opset6">
			<data eps="9.9999999747524271e-07" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_140300_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 192" offset="371368" size="384" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_140300" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="__module.model.backbone.blocks.0.norm1/aten::layer_norm/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_140301_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 192" offset="371752" size="384" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_140301" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="__module.model.backbone.blocks.0.norm1/aten::layer_norm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="63,x.7">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="self.model.backbone.blocks.0.attn.qkv.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="576, 192" offset="372136" size="221184" />
			<output>
				<port id="0" precision="FP16" names="self.model.backbone.blocks.0.attn.qkv.weight">
					<dim>576</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="self.model.backbone.blocks.0.attn.qkv.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>576</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>576</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="__module.model.backbone.blocks.0.attn.qkv/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>576</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>576</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_140302_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 576" offset="593320" size="1152" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>576</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_140302" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>576</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>576</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="__module.model.backbone.blocks.0.attn.qkv/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>576</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>576</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="71">
					<dim>1</dim>
					<dim>197</dim>
					<dim>576</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_132334" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="594472" size="40" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="__module.model.backbone.blocks.0.attn/aten::reshape/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>576</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="73">
					<dim>1</dim>
					<dim>197</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="__module.model.backbone.blocks.0.attn/aten::permute/Mod" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="594512" size="40" />
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="__module.model.backbone.blocks.0.attn/aten::permute/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="75,qkv.1">
					<dim>3</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="7" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="594552" size="8" />
			<output>
				<port id="0" precision="I64" names="7" />
			</output>
		</layer>
		<layer id="36" name="__module.model.backbone.blocks.0.attn/prim::ListUnpack/Split" type="Split" version="opset1">
			<data num_splits="3" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="__module.model.backbone.blocks.0.attn/prim::ListUnpack/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="77,q.1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="__module.model.backbone.blocks.0.attn/prim::ListUnpack/Squeeze_0" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="78,k.1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="__module.model.backbone.blocks.0.attn/prim::ListUnpack/Squeeze_1" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="79,v.1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="__module.model.backbone.blocks.0.attn/aten::scaled_dot_product_attention/ScaledDotProductAttention" type="ScaledDotProductAttention" version="opset13">
			<data causal="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="80,x.9">
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="__module.model.backbone.blocks.0.attn/aten::transpose/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="594560" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="__module.model.backbone.blocks.0.attn/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="81">
					<dim>1</dim>
					<dim>197</dim>
					<dim>3</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_132433" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="594576" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="__module.model.backbone.blocks.0.attn/aten::reshape/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>3</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="83,input.5">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="self.model.backbone.blocks.0.attn.proj.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="192, 192" offset="594600" size="73728" />
			<output>
				<port id="0" precision="FP16" names="self.model.backbone.blocks.0.attn.proj.weight">
					<dim>192</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="self.model.backbone.blocks.0.attn.proj.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="__module.model.backbone.blocks.0.attn.proj/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_140303_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 192" offset="668328" size="384" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_140303" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="__module.model.backbone.blocks.0.attn.proj/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="86,input.7">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="__module.model.backbone.blocks.0/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="88,input.9">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="__module.model.backbone.blocks.0.norm2/aten::layer_norm/Multiply" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="371364" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="__module.model.backbone.blocks.0.norm2/aten::layer_norm/MVN" type="MVN" version="opset6">
			<data eps="9.9999999747524271e-07" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_140304_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 192" offset="668712" size="384" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_140304" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="__module.model.backbone.blocks.0.norm2/aten::layer_norm/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Constant_140305_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 192" offset="669096" size="384" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Constant_140305" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="__module.model.backbone.blocks.0.norm2/aten::layer_norm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="92,input.11">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="self.model.backbone.blocks.0.mlp.fc1.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="768, 192" offset="669480" size="294912" />
			<output>
				<port id="0" precision="FP16" names="self.model.backbone.blocks.0.mlp.fc1.weight">
					<dim>768</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="self.model.backbone.blocks.0.mlp.fc1.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>768</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="__module.model.backbone.blocks.0.mlp.fc1/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Constant_140306_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="964392" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_140306" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="__module.model.backbone.blocks.0.mlp.fc1/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="97,input.13">
					<dim>1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="__module.model.backbone.blocks.0.mlp.act/aten::gelu/Gelu" type="Gelu" version="opset7">
			<data approximation_mode="ERF" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="98,input.15">
					<dim>1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="self.model.backbone.blocks.0.mlp.fc2.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="192, 768" offset="965928" size="294912" />
			<output>
				<port id="0" precision="FP16" names="self.model.backbone.blocks.0.mlp.fc2.weight">
					<dim>192</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="self.model.backbone.blocks.0.mlp.fc2.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="__module.model.backbone.blocks.0.mlp.fc2/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_140307_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 192" offset="1260840" size="384" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Constant_140307" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="__module.model.backbone.blocks.0.mlp.fc2/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="102,input.19">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="__module.model.backbone.blocks.0/aten::add/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="104,input.21">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="__module.model.backbone.blocks.1.norm1/aten::layer_norm/Multiply" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="371364" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="__module.model.backbone.blocks.1.norm1/aten::layer_norm/MVN" type="MVN" version="opset6">
			<data eps="9.9999999747524271e-07" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Constant_140308_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 192" offset="1261224" size="384" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_140308" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="__module.model.backbone.blocks.1.norm1/aten::layer_norm/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Constant_140309_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 192" offset="1261608" size="384" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Constant_140309" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="__module.model.backbone.blocks.1.norm1/aten::layer_norm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="112,x.11">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="self.model.backbone.blocks.1.attn.qkv.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="576, 192" offset="1261992" size="221184" />
			<output>
				<port id="0" precision="FP16" names="self.model.backbone.blocks.1.attn.qkv.weight">
					<dim>576</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="self.model.backbone.blocks.1.attn.qkv.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>576</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>576</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="__module.model.backbone.blocks.1.attn.qkv/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>576</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>576</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Constant_140310_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 576" offset="1483176" size="1152" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>576</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_140310" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>576</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>576</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="__module.model.backbone.blocks.1.attn.qkv/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>576</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>576</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="120">
					<dim>1</dim>
					<dim>197</dim>
					<dim>576</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_132543" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="594472" size="40" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="__module.model.backbone.blocks.1.attn/aten::reshape/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>576</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="122">
					<dim>1</dim>
					<dim>197</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="__module.model.backbone.blocks.1.attn/aten::permute/Mod" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="594512" size="40" />
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="__module.model.backbone.blocks.1.attn/aten::permute/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="124,qkv.3">
					<dim>3</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="__module.model.backbone.blocks.1.attn/prim::ListUnpack/Split" type="Split" version="opset1">
			<data num_splits="3" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="__module.model.backbone.blocks.1.attn/prim::ListUnpack/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="126,q.3">
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="__module.model.backbone.blocks.1.attn/prim::ListUnpack/Squeeze_0" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="127,k.3">
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="__module.model.backbone.blocks.1.attn/prim::ListUnpack/Squeeze_1" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="128,v.3">
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="__module.model.backbone.blocks.1.attn/aten::scaled_dot_product_attention/ScaledDotProductAttention" type="ScaledDotProductAttention" version="opset13">
			<data causal="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="129,x.13">
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="__module.model.backbone.blocks.1.attn/aten::transpose/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="594560" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="__module.model.backbone.blocks.1.attn/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="130">
					<dim>1</dim>
					<dim>197</dim>
					<dim>3</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_132642" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="594576" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="__module.model.backbone.blocks.1.attn/aten::reshape/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>3</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="132,input.23">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="self.model.backbone.blocks.1.attn.proj.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="192, 192" offset="1484328" size="73728" />
			<output>
				<port id="0" precision="FP16" names="self.model.backbone.blocks.1.attn.proj.weight">
					<dim>192</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="self.model.backbone.blocks.1.attn.proj.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="__module.model.backbone.blocks.1.attn.proj/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Constant_140311_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 192" offset="1558056" size="384" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Constant_140311" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="__module.model.backbone.blocks.1.attn.proj/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="135,input.25">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="__module.model.backbone.blocks.1/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="137,input.27">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="__module.model.backbone.blocks.1.norm2/aten::layer_norm/Multiply" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="371364" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="__module.model.backbone.blocks.1.norm2/aten::layer_norm/MVN" type="MVN" version="opset6">
			<data eps="9.9999999747524271e-07" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Constant_140312_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 192" offset="1558440" size="384" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Constant_140312" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
